// 预加载的动画数据
export const animeData = {
  "1996": {
    "1": {
      "id": 899,
      "name": "名探偵コナン",
      "name_cn": "名侦探柯南"
    },
    "2": {
      "id": 2712,
      "name": "るろうに剣心 -明治剣客浪漫譚-",
      "name_cn": "浪客剑心"
    },
    "3": {
      "id": 2664,
      "name": "機動戦士ガンダム 第08MS小隊",
      "name_cn": "机动战士高达 第08MS小队"
    },
    "4": {
      "id": 515,
      "name": "機動戦艦ナデシコ",
      "name_cn": "机动战舰抚子号"
    },
    "5": {
      "id": 9567,
      "name": "爆走兄弟レッツ&ゴー!!",
      "name_cn": "四驱兄弟"
    },
    "6": {
      "id": 2074,
      "name": "逮捕しちゃうぞ",
      "name_cn": "逮捕令"
    },
    "7": {
      "id": 9566,
      "name": "ドラゴンボールGT",
      "name_cn": "龙珠GT"
    },
    "8": {
      "id": 2096,
      "name": "スレイヤーズNEXT",
      "name_cn": "秀逗魔导士NEXT"
    },
    "9": {
      "id": 3633,
      "name": "機動新世紀ガンダムX",
      "name_cn": "机动新世纪高达X"
    },
    "10": {
      "id": 54539,
      "name": "YELLOW STAR",
      "name_cn": "黄色的星星"
    },
    "11": {
      "id": 2751,
      "name": "B'T-X",
      "name_cn": "钢铁神兵B'T-X"
    },
    "12": {
      "id": 2166,
      "name": "こちら葛飾区亀有公園前派出所",
      "name_cn": "乌龙派出所"
    },
    "13": {
      "id": 10378,
      "name": "天空のエスカフローネ",
      "name_cn": "天空之艾斯嘉科尼"
    },
    "14": {
      "id": 1957,
      "name": "新世紀GPXサイバーフォーミュラSAGA",
      "name_cn": "高智能方程式：SAGA"
    },
    "15": {
      "id": 458,
      "name": "ドラえもん のび太と銀河超特急",
      "name_cn": "哆啦A梦：大雄与银河超特急"
    },
    "16": {
      "id": 25716,
      "name": "Beast Wars: Transformers",
      "name_cn": "超能勇士：变形金刚"
    },
    "17": {
      "id": 3697,
      "name": "イーハトーブ幻想〜KENjIの春",
      "name_cn": "贤治之春"
    },
    "18": {
      "id": 1515,
      "name": "こどものおもちゃ",
      "name_cn": "玩偶游戏"
    },
    "19": {
      "id": 5434,
      "name": "美少女戦士セーラームーンセーラースターズ",
      "name_cn": "美少女战士Sailor Stars"
    },
    "20": {
      "id": 8970,
      "name": "クレヨンしんちゃん ヘンダーランドの大冒険",
      "name_cn": "蜡笔小新 奇异乐园大冒险"
    }
  },
  "1997": {
    "1": {
      "id": 6049,
      "name": "新世紀エヴァンゲリオン劇場版 Air/まごころを、君に",
      "name_cn": "新世纪福音战士剧场版 Air/真心为你"
    },
    "2": {
      "id": 310,
      "name": "もののけ姫",
      "name_cn": "幽灵公主"
    },
    "3": {
      "id": 6048,
      "name": "新世紀エヴァンゲリオン劇場版 シト新生",
      "name_cn": "新世纪福音战士剧场版 死与新生"
    },
    "4": {
      "id": 1453,
      "name": "少女革命ウテナ",
      "name_cn": "少女革命"
    },
    "5": {
      "id": 3019,
      "name": "ポケットモンスター",
      "name_cn": "精灵宝可梦"
    },
    "6": {
      "id": 2968,
      "name": "名探偵コナン 時計じかけの摩天楼",
      "name_cn": "名侦探柯南 引爆摩天楼"
    },
    "7": {
      "id": 1934,
      "name": "中華一番!",
      "name_cn": "中华小当家"
    },
    "8": {
      "id": 696,
      "name": "剣風伝奇ベルセルク",
      "name_cn": "剑风传奇"
    },
    "9": {
      "id": 9588,
      "name": "金田一少年の事件簿",
      "name_cn": "金田一少年事件簿"
    },
    "10": {
      "id": 1974,
      "name": "超魔神英雄伝ワタル",
      "name_cn": "超魔神英雄传"
    },
    "11": {
      "id": 47759,
      "name": "爆走兄弟レッツ&ゴー!!WGP",
      "name_cn": "四驱兄弟WGP"
    },
    "12": {
      "id": 8412,
      "name": "超特急ヒカリアン",
      "name_cn": "铁胆火车侠"
    },
    "13": {
      "id": 2097,
      "name": "スレイヤーズTRY",
      "name_cn": "秀逗魔导士TRY"
    },
    "14": {
      "id": 1894,
      "name": "勇者王ガオガイガー",
      "name_cn": "勇者王GaoGaiGar"
    },
    "15": {
      "id": 4025,
      "name": "ドクタースランプ",
      "name_cn": "阿拉蕾"
    },
    "16": {
      "id": 39530,
      "name": "新機動戦記ガンダムW Endless Waltz",
      "name_cn": "新机动战记高达W 无尽的华尔兹"
    },
    "17": {
      "id": 25442,
      "name": "South Park Season 1",
      "name_cn": "南方公园 第1季"
    },
    "18": {
      "id": 4466,
      "name": "吸血姫美夕",
      "name_cn": "吸血姬美夕"
    },
    "19": {
      "id": 36686,
      "name": "AIKa",
      "name_cn": "海底娇娃蓝华"
    },
    "20": {
      "id": 3175,
      "name": "マクロス ダイナマイト7",
      "name_cn": "超时空要塞 Dynamite 7"
    }
  },
  "1998": {
    "1": {
      "id": 253,
      "name": "カウボーイビバップ",
      "name_cn": "星际牛仔"
    },
    "2": {
      "id": 1940,
      "name": "カードキャプターさくら",
      "name_cn": "魔卡少女樱"
    },
    "3": {
      "id": 839,
      "name": "PERFECT BLUE",
      "name_cn": "蓝色恐惧"
    },
    "4": {
      "id": 39923,
      "name": "REVIVAL OF EVANGELION 新世紀エヴァンゲリオン劇場版 DEATH (TRUE)² / Air / まごころを、君に",
      "name_cn": "新世纪福音战士剧场版 DEATH(TRUE)2/Air/真心为你"
    },
    "5": {
      "id": 2582,
      "name": "Serial Experiments Lain",
      "name_cn": "玲音"
    },
    "6": {
      "id": 25469,
      "name": "A KITE",
      "name_cn": "风筝"
    },
    "7": {
      "id": 8290,
      "name": "頭文字D",
      "name_cn": "头文字D"
    },
    "8": {
      "id": 2969,
      "name": "名探偵コナン 14番目の標的",
      "name_cn": "名侦探柯南 第14号目标"
    },
    "9": {
      "id": 2049,
      "name": "彼氏彼女の事情",
      "name_cn": "他和她的故事"
    },
    "10": {
      "id": 12344,
      "name": "遊☆戯☆王",
      "name_cn": "游戏王"
    },
    "11": {
      "id": 3022,
      "name": "劇場版ポケットモンスター ミュウツーの逆襲",
      "name_cn": "剧场版 精灵宝可梦 超梦的逆袭"
    },
    "12": {
      "id": 9713,
      "name": "ヨコハマ買い出し紀行",
      "name_cn": "横滨购物纪行"
    },
    "13": {
      "id": 7159,
      "name": "TRIGUN",
      "name_cn": "枪神"
    },
    "14": {
      "id": 516,
      "name": "機動戦艦ナデシコ -The prince of darkness-",
      "name_cn": "机动战舰抚子号 暗黑王子"
    },
    "15": {
      "id": 2772,
      "name": "新機動戦記ガンダムW Endless Waltz 特別篇",
      "name_cn": "新机动战记高达W 无尽的华尔兹 剧场版"
    },
    "16": {
      "id": 4400,
      "name": "ロスト・ユニバース",
      "name_cn": "失落的宇宙"
    },
    "17": {
      "id": 1933,
      "name": "青の6号",
      "name_cn": "青之6号"
    },
    "18": {
      "id": 30627,
      "name": "The Powerpuff Girls",
      "name_cn": "飞天小女警"
    },
    "19": {
      "id": 23213,
      "name": "真ゲッターロボ 世界最後の日",
      "name_cn": "真盖塔 世界最后之日"
    },
    "20": {
      "id": 40188,
      "name": "Mulan",
      "name_cn": "花木兰"
    }
  },
  "1999": {
    "1": {
      "id": 975,
      "name": "ONE PIECE",
      "name_cn": "航海王"
    },
    "2": {
      "id": 1728,
      "name": "るろうに剣心 -明治剣客浪漫譚- 追憶編",
      "name_cn": "浪客剑心 追忆篇"
    },
    "3": {
      "id": 3128,
      "name": "デジモンアドベンチャー",
      "name_cn": "数码宝贝大冒险"
    },
    "4": {
      "id": 1704,
      "name": "HUNTER×HUNTER",
      "name_cn": "猎人"
    },
    "5": {
      "id": 2970,
      "name": "名探偵コナン 世紀末の魔術師",
      "name_cn": "名侦探柯南 世纪末的魔术师"
    },
    "6": {
      "id": 844,
      "name": "人狼 JIN-ROH",
      "name_cn": "人狼"
    },
    "7": {
      "id": 3553,
      "name": "∀ガンダム",
      "name_cn": "∀高达"
    },
    "8": {
      "id": 1891,
      "name": "少女革命ウテナ アドゥレセンス黙示録",
      "name_cn": "少女革命剧场版 思春期默示录"
    },
    "9": {
      "id": 1937,
      "name": "無限のリヴァイアス",
      "name_cn": "无限的未知"
    },
    "10": {
      "id": 7777,
      "name": "SpongeBob SquarePants (Season 1)",
      "name_cn": "海绵宝宝 第一季"
    },
    "11": {
      "id": 2045,
      "name": "GTO",
      "name_cn": "麻辣教师GTO"
    },
    "12": {
      "id": 1941,
      "name": "劇場版 カードキャプターさくら",
      "name_cn": "魔卡少女樱 香港之旅"
    },
    "13": {
      "id": 4075,
      "name": "今、そこにいる僕",
      "name_cn": "此时此刻的我"
    },
    "14": {
      "id": 3849,
      "name": "宝莲灯",
      "name_cn": "宝莲灯"
    },
    "15": {
      "id": 37396,
      "name": "西游记",
      "name_cn": "西游记"
    },
    "16": {
      "id": 697,
      "name": "THE ビッグオー",
      "name_cn": "THE BIG-O"
    },
    "17": {
      "id": 8296,
      "name": "ToHeart",
      "name_cn": ""
    },
    "18": {
      "id": 9568,
      "name": "頭文字D Second Stage",
      "name_cn": "头文字D Second Stage"
    },
    "19": {
      "id": 34502,
      "name": "ワーズ・ワース",
      "name_cn": "WORDS WORTH"
    },
    "20": {
      "id": 3133,
      "name": "デジモンアドベンチャー",
      "name_cn": "数码宝贝大冒险 滚球兽的诞生"
    }
  },
  "2000": {
    "1": {
      "id": 822,
      "name": "フリクリ",
      "name_cn": "FLCL"
    },
    "2": {
      "id": 2784,
      "name": "犬夜叉",
      "name_cn": "犬夜叉"
    },
    "3": {
      "id": 823,
      "name": "名探偵コナン 瞳の中の暗殺者",
      "name_cn": "名侦探柯南 瞳孔中的暗杀者"
    },
    "4": {
      "id": 1942,
      "name": "劇場版カードキャプターさくら 封印されたカード",
      "name_cn": "魔卡少女樱 被封印的卡片"
    },
    "5": {
      "id": 6390,
      "name": "遊☆戯☆王デュエルモンスターズ",
      "name_cn": "游戏王－怪兽之决斗"
    },
    "6": {
      "id": 39024,
      "name": "Jackie Chan Adventures Season 1",
      "name_cn": "成龙历险记 第一季"
    },
    "7": {
      "id": 1607,
      "name": "Vampire Hunter D: Bloodlust",
      "name_cn": "吸血鬼猎人D：妖杀行"
    },
    "8": {
      "id": 37994,
      "name": "夜勤病棟",
      "name_cn": "夜勤病栋"
    },
    "9": {
      "id": 3129,
      "name": "デジモンアドベンチャー02",
      "name_cn": "数码宝贝大冒险02"
    },
    "10": {
      "id": 2121,
      "name": "ラブひな",
      "name_cn": "纯情房东俏房客"
    },
    "11": {
      "id": 3134,
      "name": "デジモンアドベンチャー ぼくらのウォーゲーム!",
      "name_cn": "数码宝贝大冒险 我们的战争游戏!"
    },
    "12": {
      "id": 2107,
      "name": "MEZZO FORTE",
      "name_cn": "次强音"
    },
    "13": {
      "id": 2084,
      "name": "BLOOD THE LAST VAMPIRE",
      "name_cn": "BLOOD 最后的吸血鬼"
    },
    "14": {
      "id": 2060,
      "name": "サクラ大戦",
      "name_cn": "樱花大战"
    },
    "15": {
      "id": 3769,
      "name": "ブギーポップは笑わない Boogiepop Phantom",
      "name_cn": "幻影死神"
    },
    "16": {
      "id": 110783,
      "name": "SpongeBob SquarePants (Season 2)",
      "name_cn": "海绵宝宝 第二季"
    },
    "17": {
      "id": 21233,
      "name": "知世のカードキャプターさくら活躍ビデオ日記!",
      "name_cn": "魔卡少女樱 知世的活跃日记"
    },
    "18": {
      "id": 3795,
      "name": "NieA_7",
      "name_cn": "我家也有外星人"
    },
    "19": {
      "id": 3024,
      "name": "劇場版ポケットモンスター 結晶塔の帝王 ENTEI",
      "name_cn": "剧场版 精灵宝可梦 结晶塔的帝王 炎帝"
    },
    "20": {
      "id": 5977,
      "name": "幻想魔伝 最遊記",
      "name_cn": "最游记"
    }
  },
  "2001": {
    "1": {
      "id": 311,
      "name": "千と千尋の神隠し",
      "name_cn": "千与千寻"
    },
    "2": {
      "id": 840,
      "name": "千年女優",
      "name_cn": "千年女优"
    },
    "3": {
      "id": 860,
      "name": "カウボーイビバップ 天国の扉",
      "name_cn": "星际牛仔 天国之扉"
    },
    "4": {
      "id": 2971,
      "name": "名探偵コナン 天国へのカウントダウン",
      "name_cn": "名侦探柯南 通往天国的倒数计时"
    },
    "5": {
      "id": 605,
      "name": "ヒカルの碁",
      "name_cn": "棋魂"
    },
    "6": {
      "id": 880,
      "name": "フルーツバスケット",
      "name_cn": "水果篮子"
    },
    "7": {
      "id": 4028,
      "name": "ねこぢる草",
      "name_cn": "猫汤"
    },
    "8": {
      "id": 3291,
      "name": "ジャングルはいつもハレのちグゥ",
      "name_cn": "热带雨林的爆笑生活"
    },
    "9": {
      "id": 1939,
      "name": "テニスの王子様",
      "name_cn": "网球王子"
    },
    "10": {
      "id": 3130,
      "name": "デジモンテイマーズ",
      "name_cn": "数码宝贝驯兽师之王"
    },
    "11": {
      "id": 2216,
      "name": "HELLSING",
      "name_cn": "皇家国教骑士团"
    },
    "12": {
      "id": 38432,
      "name": "Bible Black",
      "name_cn": "黑暗圣经"
    },
    "13": {
      "id": 17652,
      "name": "顔のない月 -No Surface Moon THE ANIMATION-",
      "name_cn": "无颜之月"
    },
    "14": {
      "id": 334399,
      "name": "Jackie Chan Adventures Season 2",
      "name_cn": "成龙历险记 第二季"
    },
    "15": {
      "id": 8986,
      "name": "クレヨンしんちゃん 嵐を呼ぶ モーレツ!オトナ帝国の逆襲",
      "name_cn": "蜡笔小新 呼风唤雨！大人帝国的反击"
    },
    "16": {
      "id": 2328,
      "name": "メトロポリス",
      "name_cn": "大都会"
    },
    "17": {
      "id": 788,
      "name": "ノワール",
      "name_cn": "NOIR"
    },
    "18": {
      "id": 4190,
      "name": "シャーマンキング",
      "name_cn": "通灵王"
    },
    "19": {
      "id": 2141,
      "name": "まほろまてぃっく",
      "name_cn": "魔力女管家"
    },
    "20": {
      "id": 25076,
      "name": "Monsters, Inc.",
      "name_cn": "怪兽电力公司"
    }
  },
  "2002": {
    "1": {
      "id": 324,
      "name": "攻殻機動隊 STAND ALONE COMPLEX",
      "name_cn": "攻壳机动队 STAND ALONE COMPLEX"
    },
    "2": {
      "id": 3425,
      "name": "NARUTO -ナルト-",
      "name_cn": "火影忍者"
    },
    "3": {
      "id": 2972,
      "name": "名探偵コナン ベイカー街の亡霊",
      "name_cn": "名侦探柯南 贝克街的亡灵"
    },
    "4": {
      "id": 12,
      "name": "ちょびっツ",
      "name_cn": "人形电脑天使心"
    },
    "5": {
      "id": 334,
      "name": "フルメタル・パニック!",
      "name_cn": "全金属狂潮"
    },
    "6": {
      "id": 1856,
      "name": "十二国記",
      "name_cn": "十二国记"
    },
    "7": {
      "id": 1936,
      "name": "ほしのこえ",
      "name_cn": "星之声"
    },
    "8": {
      "id": 1860,
      "name": "機動戦士ガンダムSEED",
      "name_cn": "机动战士高达SEED"
    },
    "9": {
      "id": 893,
      "name": "灰羽連盟",
      "name_cn": "灰羽联盟"
    },
    "10": {
      "id": 506,
      "name": "猫の恩返し",
      "name_cn": "猫的报恩"
    },
    "11": {
      "id": 977,
      "name": "あずまんが大王 THE ANIMATION",
      "name_cn": "笑园漫画大王"
    },
    "12": {
      "id": 534,
      "name": "彼女と彼女の猫",
      "name_cn": "她和她的猫"
    },
    "13": {
      "id": 1931,
      "name": "最終兵器彼女",
      "name_cn": "最终兵器彼女"
    },
    "14": {
      "id": 1030,
      "name": "ラーゼフォン",
      "name_cn": "翼神传说"
    },
    "15": {
      "id": 2842,
      "name": "戦闘妖精雪風",
      "name_cn": "战斗妖精雪风"
    },
    "16": {
      "id": 10356,
      "name": "HUNTER×HUNTER OVA 第1期",
      "name_cn": "猎人 OVA"
    },
    "17": {
      "id": 3020,
      "name": "ポケットモンスター アドバンスジェネレーション",
      "name_cn": "精灵宝可梦 超世代"
    },
    "18": {
      "id": 297,
      "name": "おねがい☆ティーチャー",
      "name_cn": "拜托了老师"
    },
    "19": {
      "id": 40190,
      "name": "Ice Age",
      "name_cn": "冰川时代"
    },
    "20": {
      "id": 3131,
      "name": "デジモンフロンティア",
      "name_cn": "数码宝贝无限地带"
    }
  },
  "2003": {
    "1": {
      "id": 315,
      "name": "鋼の錬金術師",
      "name_cn": "钢之炼金术师"
    },
    "2": {
      "id": 842,
      "name": "東京ゴッドファーザーズ",
      "name_cn": "东京教父"
    },
    "3": {
      "id": 1948,
      "name": "キノの旅 -the Beautiful World-",
      "name_cn": "奇诺之旅"
    },
    "4": {
      "id": 338,
      "name": "フルメタル・パニック? ふもっふ",
      "name_cn": "全金属狂潮 校园篇"
    },
    "5": {
      "id": 2734,
      "name": "プラネテス",
      "name_cn": "星空清理者"
    },
    "6": {
      "id": 2973,
      "name": "名探偵コナン 迷宮の十字路",
      "name_cn": "名侦探柯南 迷宫的十字路口"
    },
    "7": {
      "id": 3304,
      "name": "GUNSLINGER GIRL",
      "name_cn": "神枪少女"
    },
    "8": {
      "id": 921,
      "name": "LAST EXILE",
      "name_cn": "最终流放"
    },
    "9": {
      "id": 4163,
      "name": "カレイドスター",
      "name_cn": "百变之星"
    },
    "10": {
      "id": 496,
      "name": "The Animatrix",
      "name_cn": "黑客帝国动画版"
    },
    "11": {
      "id": 2063,
      "name": "D.C. 〜ダ・カーポ〜",
      "name_cn": "初音岛"
    },
    "12": {
      "id": 1805,
      "name": "ガングレイヴ",
      "name_cn": "铳墓"
    },
    "13": {
      "id": 1899,
      "name": "真月譚 月姫",
      "name_cn": "真月谭月姬"
    },
    "14": {
      "id": 1650,
      "name": "君が望む永遠",
      "name_cn": "你所期望的永远"
    },
    "15": {
      "id": 44476,
      "name": "ランジェリーズ",
      "name_cn": "内衣办公室"
    },
    "16": {
      "id": 1926,
      "name": "クロノクルセイド",
      "name_cn": "圣枪修女"
    },
    "17": {
      "id": 1983,
      "name": "WOLF'S RAIN",
      "name_cn": "狼雨"
    },
    "18": {
      "id": 25075,
      "name": "Finding Nemo",
      "name_cn": "海底总动员"
    },
    "19": {
      "id": 1850,
      "name": "R.O.D -THE TV-",
      "name_cn": "读或死 TV"
    },
    "20": {
      "id": 70280,
      "name": "艶母",
      "name_cn": "艳母"
    }
  },
  "2004": {
    "1": {
      "id": 254,
      "name": "サムライチャンプルー",
      "name_cn": "混沌武士"
    },
    "2": {
      "id": 326,
      "name": "攻殻機動隊 S.A.C. 2nd GIG",
      "name_cn": "攻壳机动队 S.A.C. 2nd GIG"
    },
    "3": {
      "id": 312,
      "name": "ハウルの動く城",
      "name_cn": "哈尔的移动城堡"
    },
    "4": {
      "id": 238,
      "name": "イノセンス",
      "name_cn": "攻壳机动队2 无罪"
    },
    "5": {
      "id": 536,
      "name": "エルフェンリート",
      "name_cn": "妖精的旋律"
    },
    "6": {
      "id": 843,
      "name": "妄想代理人",
      "name_cn": "妄想代理人"
    },
    "7": {
      "id": 1959,
      "name": "MONSTER",
      "name_cn": "怪物"
    },
    "8": {
      "id": 1600,
      "name": "BLEACH",
      "name_cn": "死神"
    },
    "9": {
      "id": 440,
      "name": "スクールランブル",
      "name_cn": "校园迷糊大王"
    },
    "10": {
      "id": 1707,
      "name": "雲のむこう、約束の場所",
      "name_cn": "云之彼端，约定的地方"
    },
    "11": {
      "id": 1025,
      "name": "ローゼンメイデン",
      "name_cn": "蔷薇少女"
    },
    "12": {
      "id": 928,
      "name": "げんしけん",
      "name_cn": "现视研"
    },
    "13": {
      "id": 768,
      "name": "トップをねらえ2!",
      "name_cn": "飞跃巅峰2！"
    },
    "14": {
      "id": 1262,
      "name": "魔法少女リリカルなのは",
      "name_cn": "魔法少女奈叶"
    },
    "15": {
      "id": 2974,
      "name": "名探偵コナン 銀翼の奇術師",
      "name_cn": "名侦探柯南 银翼的魔术师"
    },
    "16": {
      "id": 2936,
      "name": "蒼穹のファフナー",
      "name_cn": "苍穹之法芙娜"
    },
    "17": {
      "id": 1861,
      "name": "機動戦士ガンダムSEED DESTINY",
      "name_cn": "机动战士高达SEED DESTINY"
    },
    "18": {
      "id": 4214,
      "name": "マリア様がみてる",
      "name_cn": "圣母在上"
    },
    "19": {
      "id": 2451,
      "name": "神無月の巫女",
      "name_cn": "神无月的巫女"
    },
    "20": {
      "id": 3324,
      "name": "マインド・ゲーム",
      "name_cn": "心灵游戏"
    }
  },
  "2005": {
    "1": {
      "id": 340,
      "name": "蟲師",
      "name_cn": "虫师"
    },
    "2": {
      "id": 234,
      "name": "AIR",
      "name_cn": ""
    },
    "3": {
      "id": 490,
      "name": "灼眼のシャナ",
      "name_cn": "灼眼的夏娜"
    },
    "4": {
      "id": 847,
      "name": "ハチミツとクローバー",
      "name_cn": "蜂蜜与四叶草"
    },
    "5": {
      "id": 531,
      "name": "ARIA The ANIMATION",
      "name_cn": "水星领航员"
    },
    "6": {
      "id": 1260,
      "name": "地獄少女",
      "name_cn": "地狱少女"
    },
    "7": {
      "id": 2461,
      "name": "ギャグマンガ日和",
      "name_cn": "搞笑漫画日和"
    },
    "8": {
      "id": 1266,
      "name": "交響詩篇エウレカセブン",
      "name_cn": "交响诗篇"
    },
    "9": {
      "id": 18692,
      "name": "ドラえもん",
      "name_cn": "哆啦A梦"
    },
    "10": {
      "id": 337,
      "name": "フルメタル・パニック! The Second Raid",
      "name_cn": "全金属狂潮 The Second Raid"
    },
    "11": {
      "id": 2127,
      "name": "AIR IN SUMMER",
      "name_cn": "AIR 夏季篇"
    },
    "12": {
      "id": 284,
      "name": "苺ましまろ",
      "name_cn": "草莓棉花糖"
    },
    "13": {
      "id": 2975,
      "name": "名探偵コナン 水平線上の陰謀",
      "name_cn": "名侦探柯南 水平线上的阴谋"
    },
    "14": {
      "id": 1890,
      "name": "FINAL FANTASY VII ADVENT CHILDREN",
      "name_cn": "最终幻想7：降临之子"
    },
    "15": {
      "id": 3916,
      "name": "バジリスク ～甲賀忍法帖～",
      "name_cn": "甲贺忍法帖"
    },
    "16": {
      "id": 1935,
      "name": "鋼の錬金術師 シャンバラを征く者",
      "name_cn": "钢之炼金术师 香巴拉的征服者"
    },
    "17": {
      "id": 1263,
      "name": "魔法少女リリカルなのはA's",
      "name_cn": "魔法少女奈叶A's"
    },
    "18": {
      "id": 1026,
      "name": "ローゼンメイデン・トロイメント",
      "name_cn": "蔷薇少女 梦之终结"
    },
    "19": {
      "id": 2059,
      "name": "闘牌伝説アカギ 〜闇に舞い降りた天才〜",
      "name_cn": "斗牌传说"
    },
    "20": {
      "id": 2891,
      "name": "ツバサ・クロニクル",
      "name_cn": "翼·年代记"
    }
  },
  "2006": {
    "1": {
      "id": 1773,
      "name": "DEATH NOTE",
      "name_cn": "死亡笔记"
    },
    "2": {
      "id": 793,
      "name": "コードギアス 反逆のルルーシュ",
      "name_cn": "Code Geass 反叛的鲁路修"
    },
    "3": {
      "id": 485,
      "name": "涼宮ハルヒの憂鬱",
      "name_cn": "凉宫春日的忧郁"
    },
    "4": {
      "id": 289,
      "name": "ひぐらしのなく頃に",
      "name_cn": "寒蝉鸣泣之时"
    },
    "5": {
      "id": 247,
      "name": "銀魂",
      "name_cn": "银魂"
    },
    "6": {
      "id": 242,
      "name": "時をかける少女",
      "name_cn": "穿越时空的少女"
    },
    "7": {
      "id": 290,
      "name": "Fate/stay night",
      "name_cn": "Fate/stay night"
    },
    "8": {
      "id": 841,
      "name": "パプリカ",
      "name_cn": "红辣椒"
    },
    "9": {
      "id": 995,
      "name": "N・H・Kにようこそ！",
      "name_cn": "欢迎加入NHK！"
    },
    "10": {
      "id": 1880,
      "name": "ゼロの使い魔",
      "name_cn": "零之使魔"
    },
    "11": {
      "id": 274,
      "name": "Kanon",
      "name_cn": ""
    },
    "12": {
      "id": 979,
      "name": "BLACK LAGOON",
      "name_cn": "黑礁"
    },
    "13": {
      "id": 493,
      "name": "HELLSING OVA",
      "name_cn": "皇家国教骑士团 OVA"
    },
    "14": {
      "id": 486,
      "name": "NANA－ナナ－",
      "name_cn": "娜娜"
    },
    "15": {
      "id": 2439,
      "name": "×××HOLiC",
      "name_cn": ""
    },
    "16": {
      "id": 848,
      "name": "ハチミツとクローバー II",
      "name_cn": "蜂蜜与四叶草II"
    },
    "17": {
      "id": 980,
      "name": "BLACK LAGOON The Second Barrage",
      "name_cn": "黑礁 The Second Barrage"
    },
    "18": {
      "id": 1487,
      "name": "桜蘭高校ホスト部",
      "name_cn": "樱兰高校男公关部"
    },
    "19": {
      "id": 320,
      "name": "攻殻機動隊 STAND ALONE COMPLEX Solid State Society",
      "name_cn": "攻壳机动队 S.A.C. Solid State Society"
    },
    "20": {
      "id": 4562,
      "name": "家庭教師ヒットマンREBORN!",
      "name_cn": "家庭教师HITMAN REBORN!"
    }
  },
  "2007": {
    "1": {
      "id": 51,
      "name": "CLANNAD -クラナド-",
      "name_cn": "CLANNAD"
    },
    "2": {
      "id": 927,
      "name": "秒速5センチメートル",
      "name_cn": "秒速5厘米"
    },
    "3": {
      "id": 276,
      "name": "らき☆すた",
      "name_cn": "幸运星"
    },
    "4": {
      "id": 770,
      "name": "天元突破グレンラガン",
      "name_cn": "天元突破 红莲螺岩"
    },
    "5": {
      "id": 965,
      "name": "BACCANO! -バッカーノ!-",
      "name_cn": "永生之酒"
    },
    "6": {
      "id": 772,
      "name": "ヱヴァンゲリヲン新劇場版:序",
      "name_cn": "福音战士新剧场版：序"
    },
    "7": {
      "id": 288,
      "name": "ひぐらしのなく頃に解",
      "name_cn": "寒蝉鸣泣之时 解"
    },
    "8": {
      "id": 292,
      "name": "DARKER THAN BLACK -黒の契約者-",
      "name_cn": "DARKER THAN BLACK -黑之契约者-"
    },
    "9": {
      "id": 233,
      "name": "劇場版 空の境界 第一章 俯瞰風景",
      "name_cn": "剧场版 空之境界 第一章 俯瞰风景"
    },
    "10": {
      "id": 827,
      "name": "School Days",
      "name_cn": "日在校园"
    },
    "11": {
      "id": 812,
      "name": "劇場版 空の境界 第二章 殺人考察(前)",
      "name_cn": "剧场版 空之境界 第二章 杀人考察（前）"
    },
    "12": {
      "id": 799,
      "name": "ef - a tale of memories.",
      "name_cn": "悠久之翼"
    },
    "13": {
      "id": 283,
      "name": "みなみけ",
      "name_cn": "南家三姐妹"
    },
    "14": {
      "id": 299,
      "name": "さよなら絶望先生",
      "name_cn": "再见绝望先生"
    },
    "15": {
      "id": 794,
      "name": "電脳コイル",
      "name_cn": "电脑线圈"
    },
    "16": {
      "id": 2782,
      "name": "NARUTO -ナルト- 疾風伝",
      "name_cn": "火影忍者疾风传"
    },
    "17": {
      "id": 3892,
      "name": "逆境無頼カイジ Ultimate Survivor",
      "name_cn": "赌博默示录"
    },
    "18": {
      "id": 491,
      "name": "灼眼のシャナII",
      "name_cn": "灼眼的夏娜II"
    },
    "19": {
      "id": 808,
      "name": "ハヤテのごとく!",
      "name_cn": "旋风管家"
    },
    "20": {
      "id": 805,
      "name": "瀬戸の花嫁",
      "name_cn": "濑户的花嫁"
    }
  },
  "2008": {
    "1": {
      "id": 876,
      "name": "CLANNAD 〜AFTER STORY〜",
      "name_cn": ""
    },
    "2": {
      "id": 909,
      "name": "とらドラ！",
      "name_cn": "龙与虎"
    },
    "3": {
      "id": 8,
      "name": "コードギアス 反逆のルルーシュR2",
      "name_cn": "Code Geass 反叛的鲁路修R2"
    },
    "4": {
      "id": 1014,
      "name": "とある魔術の禁書目録",
      "name_cn": "魔法禁书目录"
    },
    "5": {
      "id": 282,
      "name": "狼と香辛料",
      "name_cn": "狼与香辛料"
    },
    "6": {
      "id": 259,
      "name": "夏目友人帳",
      "name_cn": "夏目友人帐"
    },
    "7": {
      "id": 1333,
      "name": "劇場版 空の境界 第五章 矛盾螺旋",
      "name_cn": "剧场版 空之境界 第五章 矛盾螺旋"
    },
    "8": {
      "id": 767,
      "name": "劇場版 空の境界 第三章 痛覚残留",
      "name_cn": "剧场版 空之境界 第三章 痛觉残留"
    },
    "9": {
      "id": 37873,
      "name": "CLANNAD もうひとつの世界 智代編",
      "name_cn": "CLANNAD 另一个世界 智代篇"
    },
    "10": {
      "id": 766,
      "name": "劇場版 空の境界 第四章 伽藍の洞",
      "name_cn": "剧场版 空之境界 第四章 伽蓝之洞"
    },
    "11": {
      "id": 849,
      "name": "To LOVEる -とらぶる-",
      "name_cn": "出包王女"
    },
    "12": {
      "id": 309,
      "name": "true tears",
      "name_cn": "真实之泪"
    },
    "13": {
      "id": 2225,
      "name": "劇場版 空の境界 第六章 忘却録音",
      "name_cn": "剧场版 空之境界 第六章 忘却录音"
    },
    "14": {
      "id": 1029,
      "name": "ef - a tale of melodies.",
      "name_cn": "悠久之翼2"
    },
    "15": {
      "id": 1104,
      "name": "Wall·E",
      "name_cn": "机器人总动员"
    },
    "16": {
      "id": 13557,
      "name": "らき☆すた OVA",
      "name_cn": "幸运星 OVA"
    },
    "17": {
      "id": 885,
      "name": "喰霊-零-",
      "name_cn": "食灵-零-"
    },
    "18": {
      "id": 902,
      "name": "かんなぎ",
      "name_cn": "神薙"
    },
    "19": {
      "id": 866,
      "name": "SOUL EATER",
      "name_cn": "噬魂师"
    },
    "20": {
      "id": 763,
      "name": "ゼロの使い魔 ～三美姫の輪舞～",
      "name_cn": "零之使魔 三美姬的轮舞"
    }
  },
  "2009": {
    "1": {
      "id": 1424,
      "name": "けいおん！",
      "name_cn": "轻音少女"
    },
    "2": {
      "id": 1428,
      "name": "鋼の錬金術師 FULLMETAL ALCHEMIST",
      "name_cn": "钢之炼金术师 FULLMETAL ALCHEMIST"
    },
    "3": {
      "id": 1671,
      "name": "化物語",
      "name_cn": "化物语"
    },
    "4": {
      "id": 2585,
      "name": "とある科学の超電磁砲",
      "name_cn": "某科学的超电磁炮"
    },
    "5": {
      "id": 1606,
      "name": "涼宮ハルヒの憂鬱",
      "name_cn": "凉宫春日的忧郁 2009"
    },
    "6": {
      "id": 3302,
      "name": "ヱヴァンゲリヲン新劇場版:破",
      "name_cn": "福音战士新剧场版：破"
    },
    "7": {
      "id": 1905,
      "name": "サマーウォーズ",
      "name_cn": "夏日大作战"
    },
    "8": {
      "id": 2617,
      "name": "そらのおとしもの",
      "name_cn": "天降之物"
    },
    "9": {
      "id": 1512,
      "name": "狼と香辛料Ⅱ",
      "name_cn": "狼与香辛料 第二季"
    },
    "10": {
      "id": 3423,
      "name": "劇場版 空の境界 第七章 殺人考察(後)",
      "name_cn": "剧场版 空之境界 第七章 杀人考察（后）"
    },
    "11": {
      "id": 2567,
      "name": "生徒会の一存",
      "name_cn": "学生会的一己之见"
    },
    "12": {
      "id": 37874,
      "name": "CLANNAD 〜AFTER STORY〜もうひとつの世界 杏編",
      "name_cn": "CLANNAD ～AFTER STORY～另一个世界 杏篇"
    },
    "13": {
      "id": 891,
      "name": "続 夏目友人帳",
      "name_cn": "续 夏目友人帐"
    },
    "14": {
      "id": 1444,
      "name": "咲-Saki-",
      "name_cn": "天才麻将少女"
    },
    "15": {
      "id": 2790,
      "name": "君に届け",
      "name_cn": "好想告诉你"
    },
    "16": {
      "id": 1451,
      "name": "東のエデン",
      "name_cn": "东之伊甸"
    },
    "17": {
      "id": 993,
      "name": "WHITE ALBUM",
      "name_cn": "白色相簿"
    },
    "18": {
      "id": 2354,
      "name": "DARKER THAN BLACK -流星の双子-",
      "name_cn": "DARKER THAN BLACK -流星的双子-"
    },
    "19": {
      "id": 2609,
      "name": "FAIRY TAIL",
      "name_cn": "妖精的尾巴"
    },
    "20": {
      "id": 1372,
      "name": "涼宮ハルヒちゃんの憂鬱",
      "name_cn": "小凉宫春日的忧郁"
    }
  },
  "2010": {
    "1": {
      "id": 3375,
      "name": "涼宮ハルヒの消失",
      "name_cn": "凉宫春日的消失"
    },
    "2": {
      "id": 3774,
      "name": "けいおん！！",
      "name_cn": "轻音少女 第二季"
    },
    "3": {
      "id": 1851,
      "name": "Angel Beats!",
      "name_cn": "天使的心跳！"
    },
    "4": {
      "id": 5436,
      "name": "俺の妹がこんなに可愛いわけがない",
      "name_cn": "我的妹妹哪有这么可爱！"
    },
    "5": {
      "id": 4019,
      "name": "四畳半神話大系",
      "name_cn": "四叠半神话大系"
    },
    "6": {
      "id": 2463,
      "name": "デュラララ!!",
      "name_cn": "无头骑士异闻录"
    },
    "7": {
      "id": 3326,
      "name": "バカとテストと召喚獣",
      "name_cn": "笨蛋，测验，召唤兽"
    },
    "8": {
      "id": 7157,
      "name": "ヨスガノソラ",
      "name_cn": "缘之空"
    },
    "9": {
      "id": 8402,
      "name": "Panty & Stocking with Garterbelt",
      "name_cn": "吊带袜天使"
    },
    "10": {
      "id": 7843,
      "name": "とある魔術の禁書目録Ⅱ",
      "name_cn": "魔法禁书目录 第二季"
    },
    "11": {
      "id": 5649,
      "name": "生徒会役員共",
      "name_cn": "妄想学生会"
    },
    "12": {
      "id": 5976,
      "name": "神のみぞ知るセカイ",
      "name_cn": "只有神知道的世界"
    },
    "13": {
      "id": 2464,
      "name": "荒川アンダー ザ ブリッジ",
      "name_cn": "荒川爆笑团"
    },
    "14": {
      "id": 3428,
      "name": "バクマン。",
      "name_cn": "爆漫王。"
    },
    "15": {
      "id": 4255,
      "name": "WORKING!!",
      "name_cn": "迷糊餐厅"
    },
    "16": {
      "id": 5647,
      "name": "学園黙示録 HIGHSCHOOL OF THE DEAD",
      "name_cn": "学园默示录 HIGHSCHOOL OF THE DEAD"
    },
    "17": {
      "id": 7150,
      "name": "そらのおとしものf",
      "name_cn": "天降之物f"
    },
    "18": {
      "id": 7883,
      "name": "それでも町は廻っている",
      "name_cn": "女仆咖啡厅"
    },
    "19": {
      "id": 98371,
      "name": "とある科学の超電磁砲 炎天下の撮影モデルも楽じゃありませんわね",
      "name_cn": "某科学的超电磁炮 OVA"
    },
    "20": {
      "id": 5653,
      "name": "屍鬼",
      "name_cn": "尸鬼"
    }
  },
  "2011": {
    "1": {
      "id": 10380,
      "name": "STEINS;GATE",
      "name_cn": "命运石之门"
    },
    "2": {
      "id": 9717,
      "name": "魔法少女まどか☆マギカ",
      "name_cn": "魔法少女小圆"
    },
    "3": {
      "id": 10639,
      "name": "Fate/Zero",
      "name_cn": "Fate/Zero"
    },
    "4": {
      "id": 9912,
      "name": "日常",
      "name_cn": "日常"
    },
    "5": {
      "id": 10440,
      "name": "あの日見た花の名前を僕達はまだ知らない。",
      "name_cn": "我们仍未知道那天所看见的花的名字。"
    },
    "6": {
      "id": 18635,
      "name": "ギルティクラウン",
      "name_cn": "罪恶王冠"
    },
    "7": {
      "id": 16235,
      "name": "未来日記",
      "name_cn": "未来日记"
    },
    "8": {
      "id": 12426,
      "name": "映画けいおん！",
      "name_cn": "轻音少女 剧场版"
    },
    "9": {
      "id": 18624,
      "name": "輪るピングドラム",
      "name_cn": "回转企鹅罐"
    },
    "10": {
      "id": 11834,
      "name": "銀魂'",
      "name_cn": "银魂'"
    },
    "11": {
      "id": 22759,
      "name": "花咲くいろは",
      "name_cn": "花开伊吕波"
    },
    "12": {
      "id": 9781,
      "name": "GOSICK -ゴシック-",
      "name_cn": "GOSICK"
    },
    "13": {
      "id": 11145,
      "name": "バカとテストと召喚獣にっ!",
      "name_cn": "笨蛋，测验，召唤兽2"
    },
    "14": {
      "id": 17883,
      "name": "僕は友達が少ない",
      "name_cn": "我的朋友很少"
    },
    "15": {
      "id": 10377,
      "name": "電波女と青春男",
      "name_cn": "电波女与青春男"
    },
    "16": {
      "id": 14588,
      "name": "ゆるゆり",
      "name_cn": "摇曳百合"
    },
    "17": {
      "id": 12536,
      "name": "夏目友人帳 参",
      "name_cn": "夏目友人帐 叁"
    },
    "18": {
      "id": 11577,
      "name": "THE IDOLM@STER",
      "name_cn": "偶像大师"
    },
    "19": {
      "id": 10843,
      "name": "うさぎドロップ",
      "name_cn": "白兔糖"
    },
    "20": {
      "id": 12544,
      "name": "蛍火の杜へ",
      "name_cn": "萤火之森"
    }
  },
  "2012": {
    "1": {
      "id": 27364,
      "name": "氷菓",
      "name_cn": "冰菓"
    },
    "2": {
      "id": 29648,
      "name": "中二病でも恋がしたい！",
      "name_cn": "中二病也要谈恋爱！"
    },
    "3": {
      "id": 23686,
      "name": "ソードアート・オンライン",
      "name_cn": "刀剑神域"
    },
    "4": {
      "id": 24790,
      "name": "男子高校生の日常",
      "name_cn": "男子高中生的日常"
    },
    "5": {
      "id": 41488,
      "name": "さくら荘のペットな彼女",
      "name_cn": "樱花庄的宠物女孩"
    },
    "6": {
      "id": 37785,
      "name": "新世界より",
      "name_cn": "来自新世界"
    },
    "7": {
      "id": 43558,
      "name": "ジョジョの奇妙な冒険",
      "name_cn": "JOJO的奇妙冒险"
    },
    "8": {
      "id": 37685,
      "name": "PSYCHO-PASS サイコパス",
      "name_cn": "心理测量者"
    },
    "9": {
      "id": 23161,
      "name": "偽物語",
      "name_cn": "伪物语"
    },
    "10": {
      "id": 20851,
      "name": "Another",
      "name_cn": ""
    },
    "11": {
      "id": 26449,
      "name": "人類は衰退しました",
      "name_cn": "人类衰退之后"
    },
    "12": {
      "id": 28230,
      "name": "さんかれあ",
      "name_cn": "散华礼弥"
    },
    "13": {
      "id": 22505,
      "name": "ヱヴァンゲリヲン新劇場版:Q",
      "name_cn": "福音战士新剧场版：Q"
    },
    "14": {
      "id": 56117,
      "name": "猫物語（黒）",
      "name_cn": "猫物语（黑）"
    },
    "15": {
      "id": 24508,
      "name": "這いよれ! ニャル子さん",
      "name_cn": "潜行吧！奈亚子"
    },
    "16": {
      "id": 40533,
      "name": "となりの怪物くん",
      "name_cn": "邻座的怪同学"
    },
    "17": {
      "id": 23685,
      "name": "アクセル・ワールド",
      "name_cn": "加速世界"
    },
    "18": {
      "id": 40310,
      "name": "ガールズ&パンツァー",
      "name_cn": "少女与战车"
    },
    "19": {
      "id": 37154,
      "name": "ココロコネクト",
      "name_cn": "心灵链环"
    },
    "20": {
      "id": 28440,
      "name": "おおかみこどもの雨と雪",
      "name_cn": "狼的孩子雨和雪"
    }
  },
  "2013": {
    "1": {
      "id": 55770,
      "name": "進撃の巨人",
      "name_cn": "进击的巨人"
    },
    "2": {
      "id": 54433,
      "name": "やはり俺の青春ラブコメはまちがっている。",
      "name_cn": "我的青春恋爱物语果然有问题"
    },
    "3": {
      "id": 72941,
      "name": "キルラキル",
      "name_cn": "斩服少女"
    },
    "4": {
      "id": 51928,
      "name": "とある科学の超電磁砲S",
      "name_cn": "某科学的超电磁炮S"
    },
    "5": {
      "id": 44693,
      "name": "劇場版 魔法少女まどか☆マギカ [新編] 叛逆の物語",
      "name_cn": "剧场版 魔法少女小圆 [新篇] 叛逆的物语"
    },
    "6": {
      "id": 58949,
      "name": "言の葉の庭",
      "name_cn": "言叶之庭"
    },
    "7": {
      "id": 55113,
      "name": "たまこまーけっと",
      "name_cn": "玉子市场"
    },
    "8": {
      "id": 49131,
      "name": "デート・ア・ライブ",
      "name_cn": "约会大作战"
    },
    "9": {
      "id": 49278,
      "name": "境界の彼方",
      "name_cn": "境界的彼方"
    },
    "10": {
      "id": 23119,
      "name": "STEINS;GATE 負荷領域のデジャヴ",
      "name_cn": "命运石之门 负荷领域的既视感"
    },
    "11": {
      "id": 78405,
      "name": "のんのんびより",
      "name_cn": "悠哉日常大王"
    },
    "12": {
      "id": 37898,
      "name": "俺の妹がこんなに可愛いわけがない。",
      "name_cn": "我的妹妹哪有这么可爱。"
    },
    "13": {
      "id": 68812,
      "name": "〈物語〉シリーズ セカンドシーズン",
      "name_cn": "物语系列 第二季"
    },
    "14": {
      "id": 50814,
      "name": "はたらく魔王さま!",
      "name_cn": "打工吧！魔王大人"
    },
    "15": {
      "id": 47889,
      "name": "凪のあすから",
      "name_cn": "来自风平浪静的明天"
    },
    "16": {
      "id": 45842,
      "name": "変態王子と笑わない猫。",
      "name_cn": "变态王子与不笑猫。"
    },
    "17": {
      "id": 49294,
      "name": "ラブライブ!",
      "name_cn": "Love Live!"
    },
    "18": {
      "id": 69496,
      "name": "WHITE ALBUM2",
      "name_cn": "白色相簿2"
    },
    "19": {
      "id": 56093,
      "name": "ダンガンロンパ 希望の学園と絶望の高校生 THE ANIMATION",
      "name_cn": "弹丸论破 希望学园与绝望高中生"
    },
    "20": {
      "id": 43557,
      "name": "俺の彼女と幼なじみが修羅場すぎる",
      "name_cn": "我女友与青梅竹马的惨烈修罗场"
    }
  },
  "2014": {
    "1": {
      "id": 110467,
      "name": "SHIROBAKO",
      "name_cn": "白箱"
    },
    "2": {
      "id": 100444,
      "name": "四月は君の嘘",
      "name_cn": "四月是你的谎言"
    },
    "3": {
      "id": 79227,
      "name": "ノーゲーム・ノーライフ",
      "name_cn": "游戏人生"
    },
    "4": {
      "id": 100449,
      "name": "月刊少女野崎くん",
      "name_cn": "月刊少女野崎君"
    },
    "5": {
      "id": 95225,
      "name": "Fate/stay night [Unlimited Blade Works]",
      "name_cn": "Fate/stay night [Unlimited Blade Works]"
    },
    "6": {
      "id": 85631,
      "name": "ジョジョの奇妙な冒険 スターダストクルセイダース",
      "name_cn": "JOJO的奇妙冒险 星尘斗士"
    },
    "7": {
      "id": 93739,
      "name": "ピンポン THE ANIMATION",
      "name_cn": "乒乓"
    },
    "8": {
      "id": 88433,
      "name": "寄生獣 セイの格率",
      "name_cn": "寄生兽 生命的准则"
    },
    "9": {
      "id": 72942,
      "name": "中二病でも恋がしたい！戀",
      "name_cn": "中二病也要谈恋爱！恋"
    },
    "10": {
      "id": 90880,
      "name": "たまこラブストーリー",
      "name_cn": "玉子爱情故事"
    },
    "11": {
      "id": 93545,
      "name": "甘城ブリリアントパーク",
      "name_cn": "甘城光辉游乐园"
    },
    "12": {
      "id": 92382,
      "name": "ソードアート・オンラインII",
      "name_cn": "刀剑神域 第二季"
    },
    "13": {
      "id": 93714,
      "name": "東京喰種トーキョーグール",
      "name_cn": "东京喰种"
    },
    "14": {
      "id": 82572,
      "name": "ノラガミ",
      "name_cn": "野良神"
    },
    "15": {
      "id": 74628,
      "name": "ニセコイ",
      "name_cn": "伪恋"
    },
    "16": {
      "id": 88287,
      "name": "ご注文はうさぎですか？",
      "name_cn": "请问您今天要来点兔子吗？"
    },
    "17": {
      "id": 94244,
      "name": "アカメが斬る!",
      "name_cn": "斩·赤红之瞳！"
    },
    "18": {
      "id": 76325,
      "name": "デート・ア・ライブII",
      "name_cn": "约会大作战 第二季"
    },
    "19": {
      "id": 84171,
      "name": "ハイキュー!!",
      "name_cn": "排球少年"
    },
    "20": {
      "id": 85204,
      "name": "生徒会役員共*",
      "name_cn": "妄想学生会＊"
    }
  },
  "2015": {
    "1": {
      "id": 115908,
      "name": "響け！ユーフォニアム",
      "name_cn": "吹响！悠风号"
    },
    "2": {
      "id": 127563,
      "name": "ワンパンマン",
      "name_cn": "一拳超人"
    },
    "3": {
      "id": 100403,
      "name": "冴えない彼女の育てかた",
      "name_cn": "路人女主的养成方法"
    },
    "4": {
      "id": 102134,
      "name": "やはり俺の青春ラブコメはまちがっている。続",
      "name_cn": "我的青春恋爱物语果然有问题 续"
    },
    "5": {
      "id": 120925,
      "name": "Charlotte",
      "name_cn": "夏洛特"
    },
    "6": {
      "id": 109386,
      "name": "Fate/stay night [Unlimited Blade Works] 2ndシーズン",
      "name_cn": "Fate/stay night [Unlimited Blade Works] 第二季"
    },
    "7": {
      "id": 113292,
      "name": "ジョジョの奇妙な冒険 スターダストクルセイダース エジプト編",
      "name_cn": "JOJO的奇妙冒险 星尘斗士 埃及篇"
    },
    "8": {
      "id": 120187,
      "name": "干物妹! うまるちゃん",
      "name_cn": "干物妹！小埋"
    },
    "9": {
      "id": 112146,
      "name": "オーバーロード",
      "name_cn": "OVERLORD"
    },
    "10": {
      "id": 114685,
      "name": "プラスティック・メモリーズ",
      "name_cn": "可塑性记忆"
    },
    "11": {
      "id": 106818,
      "name": "暗殺教室",
      "name_cn": "暗杀教室"
    },
    "12": {
      "id": 105075,
      "name": "血界戦線",
      "name_cn": "血界战线"
    },
    "13": {
      "id": 116287,
      "name": "ダンジョンに出会いを求めるのは間違っているだろうか",
      "name_cn": "在地下城寻求邂逅是否搞错了什么"
    },
    "14": {
      "id": 106693,
      "name": "がっこうぐらし！",
      "name_cn": "学园孤岛"
    },
    "15": {
      "id": 115780,
      "name": "下ネタという概念が存在しない退屈な世界",
      "name_cn": "没有黄段子存在的无聊世界"
    },
    "16": {
      "id": 116461,
      "name": "食戟のソーマ",
      "name_cn": "食戟之灵"
    },
    "17": {
      "id": 123568,
      "name": "ご注文はうさぎですか？？",
      "name_cn": "请问您今天要来点兔子吗？？"
    },
    "18": {
      "id": 138829,
      "name": "終物語",
      "name_cn": "终物语"
    },
    "19": {
      "id": 129988,
      "name": "ノラガミ ARAGOTO",
      "name_cn": "野良神 ARAGOTO"
    },
    "20": {
      "id": 110048,
      "name": "監獄学園",
      "name_cn": "监狱学园"
    }
  },
  "2016": {
    "1": {
      "id": 160209,
      "name": "君の名は。",
      "name_cn": "你的名字。"
    },
    "2": {
      "id": 140001,
      "name": "Re:ゼロから始める異世界生活",
      "name_cn": "Re：从零开始的异世界生活"
    },
    "3": {
      "id": 135275,
      "name": "この素晴らしい世界に祝福を！",
      "name_cn": "为美好的世界献上祝福！"
    },
    "4": {
      "id": 158316,
      "name": "モブサイコ100",
      "name_cn": "灵能百分百"
    },
    "5": {
      "id": 152091,
      "name": "響け！ユーフォニアム2",
      "name_cn": "吹响！悠风号 第二季"
    },
    "6": {
      "id": 181354,
      "name": "斉木楠雄のΨ難",
      "name_cn": "齐木楠雄的灾难"
    },
    "7": {
      "id": 117777,
      "name": "聲の形",
      "name_cn": "声之形"
    },
    "8": {
      "id": 137722,
      "name": "僕だけがいない街",
      "name_cn": "只有我不存在的城市"
    },
    "9": {
      "id": 147068,
      "name": "3月のライオン",
      "name_cn": "3月的狮子"
    },
    "10": {
      "id": 150490,
      "name": "ジョジョの奇妙な冒険 ダイヤモンドは砕けない",
      "name_cn": "JOJO的奇妙冒险 不灭钻石"
    },
    "11": {
      "id": 165829,
      "name": "坂本ですが？",
      "name_cn": "在下坂本，有何贵干？"
    },
    "12": {
      "id": 126173,
      "name": "ReLIFE",
      "name_cn": ""
    },
    "13": {
      "id": 150746,
      "name": "この美術部には問題がある！",
      "name_cn": "这个美术社大有问题！"
    },
    "14": {
      "id": 150775,
      "name": "NEW GAME!",
      "name_cn": ""
    },
    "15": {
      "id": 118781,
      "name": "甲鉄城のカバネリ",
      "name_cn": "甲铁城的卡巴内利"
    },
    "16": {
      "id": 148726,
      "name": "灰と幻想のグリムガル",
      "name_cn": "灰与幻想的格林姆迦尔"
    },
    "17": {
      "id": 7707,
      "name": "傷物語Ⅰ鉄血篇",
      "name_cn": "伤物语Ⅰ铁血篇"
    },
    "18": {
      "id": 142758,
      "name": "ネトゲの嫁は女の子じゃないと思った?",
      "name_cn": "线上游戏的老婆不可能是女生？"
    },
    "19": {
      "id": 131891,
      "name": "暗殺教室 第2期",
      "name_cn": "暗杀教室 第二季"
    },
    "20": {
      "id": 148036,
      "name": "傷物語Ⅱ熱血篇",
      "name_cn": "伤物语Ⅱ热血篇"
    }
  },
  "2017": {
    "1": {
      "id": 179949,
      "name": "小林さんちのメイドラゴン",
      "name_cn": "小林家的龙女仆"
    },
    "2": {
      "id": 203526,
      "name": "メイドインアビス",
      "name_cn": "来自深渊"
    },
    "3": {
      "id": 118335,
      "name": "進撃の巨人 Season 2",
      "name_cn": "进击的巨人 第二季"
    },
    "4": {
      "id": 218707,
      "name": "少女終末旅行",
      "name_cn": "少女终末旅行"
    },
    "5": {
      "id": 172498,
      "name": "エロマンガ先生",
      "name_cn": "埃罗芒阿老师"
    },
    "6": {
      "id": 187276,
      "name": "ノーゲーム・ノーライフ ゼロ",
      "name_cn": "游戏人生 零"
    },
    "7": {
      "id": 174043,
      "name": "この素晴らしい世界に祝福を！2",
      "name_cn": "为美好的世界献上祝福！ 第二季"
    },
    "8": {
      "id": 207573,
      "name": "月がきれい",
      "name_cn": "月色真美"
    },
    "9": {
      "id": 132734,
      "name": "冴えない彼女の育てかた ♭",
      "name_cn": "路人女主的养成方法 ♭"
    },
    "10": {
      "id": 185943,
      "name": "終末なにしてますか？ 忙しいですか？ 救ってもらっていいですか？",
      "name_cn": "末日时在做什么？有没有空？可以来拯救吗？"
    },
    "11": {
      "id": 214272,
      "name": "ようこそ実力至上主義の教室へ",
      "name_cn": "欢迎来到实力至上主义的教室"
    },
    "12": {
      "id": 214799,
      "name": "宝石の国",
      "name_cn": "宝石之国"
    },
    "13": {
      "id": 211567,
      "name": "3月のライオン 第2シリーズ",
      "name_cn": "3月的狮子 第二季"
    },
    "14": {
      "id": 188091,
      "name": "ガヴリールドロップアウト",
      "name_cn": "珈百璃的堕落"
    },
    "15": {
      "id": 193378,
      "name": "サクラダリセット",
      "name_cn": "重启咲良田"
    },
    "16": {
      "id": 109375,
      "name": "劇場版 Fate/stay night [Heaven's Feel] I.presage flower",
      "name_cn": "剧场版 Fate/stay night [天之杯] I.恶兆之花"
    },
    "17": {
      "id": 185792,
      "name": "リトルウィッチアカデミア",
      "name_cn": "小魔女学园"
    },
    "18": {
      "id": 208754,
      "name": "徒然チルドレン",
      "name_cn": "徒然喜欢你"
    },
    "19": {
      "id": 148099,
      "name": "劇場版 ソードアート・オンライン -オーディナル・スケール-",
      "name_cn": "刀剑神域 序列之争"
    },
    "20": {
      "id": 208450,
      "name": "アホガール",
      "name_cn": "笨女孩"
    }
  },
  "2018": {
    "1": {
      "id": 240038,
      "name": "青春ブタ野郎はバニーガール先輩の夢を見ない",
      "name_cn": "青春笨蛋少年不做兔女郎学姐的梦"
    },
    "2": {
      "id": 183878,
      "name": "ヴァイオレット・エヴァーガーデン",
      "name_cn": "紫罗兰永恒花园"
    },
    "3": {
      "id": 216371,
      "name": "リズと青い鳥",
      "name_cn": "莉兹与青鸟"
    },
    "4": {
      "id": 207195,
      "name": "ゆるキャン△",
      "name_cn": "摇曳露营△"
    },
    "5": {
      "id": 217300,
      "name": "進撃の巨人 Season 3",
      "name_cn": "进击的巨人 第三季"
    },
    "6": {
      "id": 218708,
      "name": "宇宙よりも遠い場所",
      "name_cn": "比宇宙更远的地方"
    },
    "7": {
      "id": 129807,
      "name": "シュタインズ・ゲート ゼロ",
      "name_cn": "命运石之门 0"
    },
    "8": {
      "id": 214265,
      "name": "少女☆歌劇 レヴュースタァライト",
      "name_cn": "少女☆歌剧 Revue Starlight"
    },
    "9": {
      "id": 252655,
      "name": "ゾンビランドサガ",
      "name_cn": "佐贺偶像是传奇"
    },
    "10": {
      "id": 235130,
      "name": "ぐらんぶる",
      "name_cn": "碧蓝之海"
    },
    "11": {
      "id": 235128,
      "name": "ジョジョの奇妙な冒険 黄金の風",
      "name_cn": "JOJO的奇妙冒险 黄金之风"
    },
    "12": {
      "id": 218711,
      "name": "ダーリン・イン・ザ・フランキス",
      "name_cn": "DARLING in the FRANXX"
    },
    "13": {
      "id": 239816,
      "name": "転生したらスライムだった件",
      "name_cn": "关于我转生变成史莱姆这档事"
    },
    "14": {
      "id": 235612,
      "name": "はたらく細胞",
      "name_cn": "工作细胞"
    },
    "15": {
      "id": 211311,
      "name": "DEVILMAN crybaby",
      "name_cn": "恶魔人 crybaby"
    },
    "16": {
      "id": 219200,
      "name": "からかい上手の高木さん",
      "name_cn": "擅长捉弄的高木同学"
    },
    "17": {
      "id": 243981,
      "name": "やがて君になる",
      "name_cn": "终将成为你"
    },
    "18": {
      "id": 218712,
      "name": "SSSS.GRIDMAN",
      "name_cn": "SSSS.古立特"
    },
    "19": {
      "id": 212003,
      "name": "ウマ娘 プリティーダービー",
      "name_cn": "赛马娘 Pretty Derby"
    },
    "20": {
      "id": 248154,
      "name": "風が強く吹いている",
      "name_cn": "强风吹拂"
    }
  },
  "2019": {
    "1": {
      "id": 248175,
      "name": "かぐや様は告らせたい～天才たちの恋愛頭脳戦～",
      "name_cn": "辉夜大小姐想让我告白～天才们的恋爱头脑战～"
    },
    "2": {
      "id": 263750,
      "name": "進撃の巨人 Season 3 Part.2",
      "name_cn": "进击的巨人 第三季 Part.2"
    },
    "3": {
      "id": 245665,
      "name": "鬼滅の刃",
      "name_cn": "鬼灭之刃"
    },
    "4": {
      "id": 269235,
      "name": "天気の子",
      "name_cn": "天气之子"
    },
    "5": {
      "id": 240760,
      "name": "モブサイコ100 Ⅱ",
      "name_cn": "灵能百分百 第二季"
    },
    "6": {
      "id": 240386,
      "name": "ヴィンランド・サガ",
      "name_cn": "冰海战记"
    },
    "7": {
      "id": 249637,
      "name": "私に天使が舞い降りた！",
      "name_cn": "天使降临到了我身边！"
    },
    "8": {
      "id": 243916,
      "name": "約束のネバーランド",
      "name_cn": "约定的梦幻岛"
    },
    "9": {
      "id": 265708,
      "name": "女子高生の無駄づかい",
      "name_cn": "女高中生的无所事事"
    },
    "10": {
      "id": 272510,
      "name": "まちカドまぞく",
      "name_cn": "街角魔族"
    },
    "11": {
      "id": 260680,
      "name": "青春ブタ野郎はゆめみる少女の夢を見ない",
      "name_cn": "青春笨蛋少年不做怀梦美少女的梦"
    },
    "12": {
      "id": 266157,
      "name": "慎重勇者 ～この勇者が俺TUEEEくせに慎重すぎる～",
      "name_cn": "慎重勇者 ～这个勇者明明超强却过分慎重～"
    },
    "13": {
      "id": 175599,
      "name": "劇場版 Fate/stay night [Heaven's Feel] II.lost butterfly",
      "name_cn": "剧场版 Fate/stay night [天之杯] II.迷失之蝶"
    },
    "14": {
      "id": 220631,
      "name": "映画 この素晴らしい世界に祝福を！紅伝説",
      "name_cn": "电影 为美好的世界献上祝福！红传说"
    },
    "15": {
      "id": 231497,
      "name": "冴えない彼女の育てかた Fine",
      "name_cn": "路人女主的养成方法 Fine"
    },
    "16": {
      "id": 256114,
      "name": "五等分の花嫁",
      "name_cn": "五等分的新娘"
    },
    "17": {
      "id": 216372,
      "name": "劇場版 響け！ユーフォニアム～誓いのフィナーレ～",
      "name_cn": "剧场版 吹响！悠风号～誓言的终章～"
    },
    "18": {
      "id": 273843,
      "name": "BEASTARS",
      "name_cn": "动物狂想曲"
    },
    "19": {
      "id": 280837,
      "name": "ヴァイオレット・エヴァーガーデン 外伝 - 永遠と自動手記人形 -",
      "name_cn": "紫罗兰永恒花园 外传 - 永远与自动手记人偶 -"
    },
    "20": {
      "id": 271151,
      "name": "からかい上手の高木さん②",
      "name_cn": "擅长捉弄的高木同学 第二季"
    }
  },
  "2020": {
    "1": {
      "id": 293049,
      "name": "かぐや様は告らせたい？～天才たちの恋愛頭脳戦～",
      "name_cn": "辉夜大小姐想让我告白？～天才们的恋爱头脑战～"
    },
    "2": {
      "id": 292970,
      "name": "魔女の旅々",
      "name_cn": "魔女之旅"
    },
    "3": {
      "id": 294993,
      "name": "呪術廻戦",
      "name_cn": "咒术回战"
    },
    "4": {
      "id": 285776,
      "name": "ID:INVADED イド：インヴェイデッド",
      "name_cn": "异度侵入"
    },
    "5": {
      "id": 278826,
      "name": "Re:ゼロから始める異世界生活 2nd season",
      "name_cn": "Re：从零开始的异世界生活 第二季"
    },
    "6": {
      "id": 285482,
      "name": "異種族レビュアーズ",
      "name_cn": "异种族风俗娘评鉴指南"
    },
    "7": {
      "id": 285666,
      "name": "進撃の巨人 The Final Season",
      "name_cn": "进击的巨人 最终季"
    },
    "8": {
      "id": 262940,
      "name": "とある科学の超電磁砲T",
      "name_cn": "某科学的超电磁炮T"
    },
    "9": {
      "id": 277954,
      "name": "やはり俺の青春ラブコメはまちがっている。完",
      "name_cn": "我的青春恋爱物语果然有问题 完"
    },
    "10": {
      "id": 282433,
      "name": "映像研には手を出すな！",
      "name_cn": "别对映像研出手！"
    },
    "11": {
      "id": 271687,
      "name": "虚構推理",
      "name_cn": "虚构推理"
    },
    "12": {
      "id": 301541,
      "name": "トニカクカワイイ",
      "name_cn": "总之就是非常可爱"
    },
    "13": {
      "id": 175600,
      "name": "劇場版 Fate/stay night [Heaven's Feel] III.spring song",
      "name_cn": "剧场版 Fate/stay night [天之杯] III.春之歌"
    },
    "14": {
      "id": 230914,
      "name": "劇場版 メイドインアビス 深き魂の黎明",
      "name_cn": "来自深渊 深邃的魂之黎明"
    },
    "15": {
      "id": 242216,
      "name": "劇場版 ヴァイオレット・エヴァーガーデン",
      "name_cn": "剧场版 紫罗兰永恒花园"
    },
    "16": {
      "id": 268545,
      "name": "痛いのは嫌なので防御力に極振りしたいと思います。",
      "name_cn": "因为太怕痛就全点防御力了。"
    },
    "17": {
      "id": 294713,
      "name": "かくしごと",
      "name_cn": "隐瞒之事"
    },
    "18": {
      "id": 296195,
      "name": "Re:ゼロから始める異世界生活 新編集版",
      "name_cn": "Re：从零开始的异世界生活 新编集版"
    },
    "19": {
      "id": 282372,
      "name": "安達としまむら",
      "name_cn": "安达与岛村"
    },
    "20": {
      "id": 264089,
      "name": "乙女ゲームの破滅フラグしかない悪役令嬢に転生してしまった…",
      "name_cn": "转生成为了只有乙女游戏破灭Flag的邪恶大小姐"
    }
  },
  "2021": {
    "1": {
      "id": 277554,
      "name": "無職転生 ～異世界行ったら本気だす～",
      "name_cn": "无职转生～到了异世界就拿出真本事～"
    },
    "2": {
      "id": 325585,
      "name": "無職転生 ～異世界行ったら本気だす～ 第2クール",
      "name_cn": "无职转生～到了异世界就拿出真本事～ 第2部分"
    },
    "3": {
      "id": 325285,
      "name": "オッドタクシー",
      "name_cn": "奇巧计程车"
    },
    "4": {
      "id": 315574,
      "name": "ウマ娘 プリティーダービー Season 2",
      "name_cn": "赛马娘 Pretty Derby 第二季"
    },
    "5": {
      "id": 302189,
      "name": "86―エイティシックス―",
      "name_cn": "86 -不存在的战区-"
    },
    "6": {
      "id": 274234,
      "name": "小林さんちのメイドラゴンS",
      "name_cn": "小林家的龙女仆S"
    },
    "7": {
      "id": 331887,
      "name": "86―エイティシックス― 第2クール",
      "name_cn": "86 -不存在的战区- 第2部分"
    },
    "8": {
      "id": 262897,
      "name": "ゆるキャン△ SEASON 2",
      "name_cn": "摇曳露营△ 第二季"
    },
    "9": {
      "id": 29883,
      "name": "シン・エヴァンゲリオン劇場版:│▌",
      "name_cn": "新・福音战士剧场版：终"
    },
    "10": {
      "id": 315069,
      "name": "ホリミヤ",
      "name_cn": "堀与宫村"
    },
    "11": {
      "id": 316247,
      "name": "Re:ゼロから始める異世界生活 2nd season 後半クール",
      "name_cn": "Re：从零开始的异世界生活 第二季 后半部分"
    },
    "12": {
      "id": 296367,
      "name": "SSSS.DYNAZENON",
      "name_cn": "SSSS.电光机王"
    },
    "13": {
      "id": 295017,
      "name": "回復術士のやり直し",
      "name_cn": "回复术士的重来人生"
    },
    "14": {
      "id": 316607,
      "name": "ワンダーエッグ・プライオリティ",
      "name_cn": "奇蛋物语"
    },
    "15": {
      "id": 335036,
      "name": "Arcane",
      "name_cn": "英雄联盟：双城之战"
    },
    "16": {
      "id": 332649,
      "name": "Sonny Boy",
      "name_cn": "漂流少年"
    },
    "17": {
      "id": 328195,
      "name": "鬼滅の刃 遊郭編",
      "name_cn": "鬼灭之刃 游郭篇"
    },
    "18": {
      "id": 294135,
      "name": "劇場版 少女☆歌劇 レヴュースタァライト",
      "name_cn": "剧场版 少女☆歌剧 Revue Starlight"
    },
    "19": {
      "id": 287488,
      "name": "ゾンビランドサガ リベンジ",
      "name_cn": "佐贺偶像是传奇 复仇"
    },
    "20": {
      "id": 325286,
      "name": "Vivy -Fluorite Eye's Song-",
      "name_cn": "薇薇 -萤石眼之歌-"
    }
  },
  "2022": {
    "1": {
      "id": 328609,
      "name": "ぼっち・ざ・ろっく！",
      "name_cn": "孤独摇滚！"
    },
    "2": {
      "id": 329906,
      "name": "SPY×FAMILY",
      "name_cn": "间谍过家家"
    },
    "3": {
      "id": 309311,
      "name": "Cyberpunk: Edgerunners",
      "name_cn": "赛博浪客"
    },
    "4": {
      "id": 317613,
      "name": "かぐや様は告らせたい-ウルトラロマンティック-",
      "name_cn": "辉夜大小姐想让我告白-超级浪漫-"
    },
    "5": {
      "id": 326895,
      "name": "サマータイムレンダ",
      "name_cn": "夏日重现"
    },
    "6": {
      "id": 364450,
      "name": "リコリス・リコイル",
      "name_cn": "莉可丽丝"
    },
    "7": {
      "id": 339326,
      "name": "異世界おじさん",
      "name_cn": "异世界舅舅"
    },
    "8": {
      "id": 321885,
      "name": "チェンソーマン",
      "name_cn": "链锯人"
    },
    "9": {
      "id": 333158,
      "name": "その着せ替え人形は恋をする",
      "name_cn": "更衣人偶坠入爱河"
    },
    "10": {
      "id": 373267,
      "name": "SPY×FAMILY 第2クール",
      "name_cn": "间谍过家家 第2部分"
    },
    "11": {
      "id": 375817,
      "name": "Engage Kiss",
      "name_cn": "契约之吻"
    },
    "12": {
      "id": 298477,
      "name": "メイドインアビス 烈日の黄金郷",
      "name_cn": "来自深渊 烈日的黄金乡"
    },
    "13": {
      "id": 329114,
      "name": "陰の実力者になりたくて！",
      "name_cn": "想要成为影之实力者！"
    },
    "14": {
      "id": 362577,
      "name": "すずめの戸締まり",
      "name_cn": "铃芽之旅"
    },
    "15": {
      "id": 331752,
      "name": "進撃の巨人 The Final Season Part.2",
      "name_cn": "进击的巨人 最终季 Part.2"
    },
    "16": {
      "id": 356756,
      "name": "パリピ孔明",
      "name_cn": "派对浪客诸葛孔明"
    },
    "17": {
      "id": 333664,
      "name": "であいもん",
      "name_cn": "相合之物"
    },
    "18": {
      "id": 353605,
      "name": "モブサイコ100 Ⅲ",
      "name_cn": "灵能百分百 第三季"
    },
    "19": {
      "id": 356774,
      "name": "よふかしのうた",
      "name_cn": "彻夜之歌"
    },
    "20": {
      "id": 332261,
      "name": "ジョジョの奇妙な冒険 ストーンオーシャン",
      "name_cn": "JOJO的奇妙冒险 石之海"
    }
  },
  "2023": {
    "1": {
      "id": 400602,
      "name": "葬送のフリーレン",
      "name_cn": "葬送的芙莉莲"
    },
    "2": {
      "id": 428735,
      "name": "BanG Dream! It's MyGO!!!!!",
      "name_cn": ""
    },
    "3": {
      "id": 386809,
      "name": "【推しの子】",
      "name_cn": "【我推的孩子】"
    },
    "4": {
      "id": 378862,
      "name": "お兄ちゃんはおしまい！",
      "name_cn": "别当欧尼酱了！"
    },
    "5": {
      "id": 404804,
      "name": "天国大魔境",
      "name_cn": "天国大魔境"
    },
    "6": {
      "id": 394260,
      "name": "僕の心のヤバイやつ",
      "name_cn": "我心里危险的东西"
    },
    "7": {
      "id": 373247,
      "name": "無職転生Ⅱ ～異世界行ったら本気だす～",
      "name_cn": "无职转生Ⅱ ～到了异世界就拿出真本事～"
    },
    "8": {
      "id": 420628,
      "name": "薬屋のひとりごと",
      "name_cn": "药屋少女的呢喃"
    },
    "9": {
      "id": 357961,
      "name": "スキップとローファー",
      "name_cn": "跃动青春"
    },
    "10": {
      "id": 424379,
      "name": "君のことが大大大大大好きな100人の彼女",
      "name_cn": "超超超超超喜欢你的100个女朋友"
    },
    "11": {
      "id": 385209,
      "name": "この素晴らしい世界に爆焔を！",
      "name_cn": "为美好的世界献上爆焰！"
    },
    "12": {
      "id": 411427,
      "name": "SPY×FAMILY Season 2",
      "name_cn": "间谍过家家 第二季"
    },
    "13": {
      "id": 419846,
      "name": "陰の実力者になりたくて！ 2nd season",
      "name_cn": "想要成为影之实力者！ 第二季"
    },
    "14": {
      "id": 369304,
      "name": "呪術廻戦 第2期",
      "name_cn": "咒术回战 第二季"
    },
    "15": {
      "id": 395714,
      "name": "転生王女と天才令嬢の魔法革命",
      "name_cn": "转生公主与天才千金的魔法革命"
    },
    "16": {
      "id": 376739,
      "name": "進撃の巨人 The Final Season 完結編 前編",
      "name_cn": "进击的巨人 最终季 完结篇 前篇"
    },
    "17": {
      "id": 413741,
      "name": "16bitセンセーション ANOTHER LAYER",
      "name_cn": "16bit的感动 ANOTHER LAYER"
    },
    "18": {
      "id": 377607,
      "name": "神無き世界のカミサマ活動",
      "name_cn": "无神世界的神明活动"
    },
    "19": {
      "id": 296739,
      "name": "ヴィンランド・サガ SEASON 2",
      "name_cn": "冰海战记 第二季"
    },
    "20": {
      "id": 369768,
      "name": "鬼滅の刃 刀鍛冶の里編",
      "name_cn": "鬼灭之刃 刀匠村篇"
    }
  },
  "2024": {
    "1": {
      "id": 464376,
      "name": "負けヒロインが多すぎる！",
      "name_cn": "败犬女主太多了！"
    },
    "2": {
      "id": 431767,
      "name": "ガールズバンドクライ",
      "name_cn": "GIRLS BAND CRY"
    },
    "3": {
      "id": 395378,
      "name": "ダンジョン飯",
      "name_cn": "迷宫饭"
    },
    "4": {
      "id": 467461,
      "name": "ダンダダン",
      "name_cn": "胆大党"
    },
    "5": {
      "id": 424663,
      "name": "魔法少女にあこがれて",
      "name_cn": "梦想成为魔法少女"
    },
    "6": {
      "id": 342667,
      "name": "この素晴らしい世界に祝福を！3",
      "name_cn": "为美好的世界献上祝福！第三季"
    },
    "7": {
      "id": 424883,
      "name": "時々ボソッとロシア語でデレる隣のアーリャさん",
      "name_cn": "不时轻声地以俄语遮羞的邻座艾莉同学"
    },
    "8": {
      "id": 441795,
      "name": "僕の心のヤバイやつ 第2期",
      "name_cn": "我心里危险的东西 第二季"
    },
    "9": {
      "id": 444557,
      "name": "無職転生Ⅱ ～異世界行ったら本気だす～ 第2クール",
      "name_cn": "无职转生Ⅱ ～到了异世界就拿出真本事～ 第2部分"
    },
    "10": {
      "id": 443428,
      "name": "【推しの子】 第2期",
      "name_cn": "【我推的孩子】 第二季"
    },
    "11": {
      "id": 393037,
      "name": "義妹生活",
      "name_cn": "义妹生活"
    },
    "12": {
      "id": 283643,
      "name": "響け！ユーフォニアム3",
      "name_cn": "吹响！悠风号 第三季"
    },
    "13": {
      "id": 425909,
      "name": "夜のクラゲは泳げない",
      "name_cn": "夜晚的水母不会游泳"
    },
    "14": {
      "id": 390353,
      "name": "俺だけレベルアップな件",
      "name_cn": "我独自升级"
    },
    "15": {
      "id": 480441,
      "name": "ルックバック",
      "name_cn": "蓦然回首"
    },
    "16": {
      "id": 425998,
      "name": "Re:ゼロから始める異世界生活 3rd season 襲擊編",
      "name_cn": "Re：从零开始的异世界生活 第三季 袭击篇"
    },
    "17": {
      "id": 404809,
      "name": "終末トレインどこへいく？",
      "name_cn": "末日列车去哪里？"
    },
    "18": {
      "id": 484761,
      "name": "しかのこのこのここしたんたん",
      "name_cn": "鹿乃子乃子乃子虎视眈眈"
    },
    "19": {
      "id": 474906,
      "name": "小市民シリーズ",
      "name_cn": "小市民系列"
    },
    "20": {
      "id": 460306,
      "name": "アオのハコ",
      "name_cn": "青之箱"
    }
  },
  "2025": {
    "1": {
      "id": 454684,
      "name": "BanG Dream! Ave Mujica",
      "name_cn": ""
    },
    "2": {
      "id": 430699,
      "name": "メダリスト",
      "name_cn": "金牌得主"
    },
    "3": {
      "id": 363957,
      "name": "Summer Pockets",
      "name_cn": "夏日口袋"
    },
    "4": {
      "id": 487630,
      "name": "俺だけレベルアップな件 Season 2 -Arise from the Shadow-",
      "name_cn": "我独自升级 第二季 -起于暗影-"
    },
    "5": {
      "id": 485936,
      "name": "mono",
      "name_cn": "mono女孩"
    },
    "6": {
      "id": 526816,
      "name": "機動戦士Gundam GQuuuuuuX",
      "name_cn": "机动战士高达 GQuuuuuuX"
    },
    "7": {
      "id": 509297,
      "name": "ウマ娘 シンデレラグレイ",
      "name_cn": "赛马娘 芦毛灰姑娘"
    },
    "8": {
      "id": 509986,
      "name": "アポカリプスホテル",
      "name_cn": "末日后酒店"
    },
    "9": {
      "id": 531159,
      "name": "日々は過ぎれど飯うまし",
      "name_cn": "时光流逝，饭菜依旧美味"
    },
    "10": {
      "id": 471793,
      "name": "君のことが大大大大大好きな100人の彼女 第2期",
      "name_cn": "超超超超超喜欢你的100个女朋友 第二季"
    },
    "11": {
      "id": 486347,
      "name": "薬屋のひとりごと 第2期",
      "name_cn": "药屋少女的呢喃 第二季"
    },
    "12": {
      "id": 506672,
      "name": "ウィッチウォッチ",
      "name_cn": "魔女与使魔"
    },
    "13": {
      "id": 446296,
      "name": "LAZARUS",
      "name_cn": "拉撒路"
    },
    "14": {
      "id": 504678,
      "name": "ロックは淑女の嗜みでして",
      "name_cn": "摇滚乃是淑女的爱好"
    },
    "15": {
      "id": 510728,
      "name": "Re:ゼロから始める異世界生活 3rd season 反擊編",
      "name_cn": "Re：从零开始的异世界生活 第三季 反击篇"
    },
    "16": {
      "id": 486039,
      "name": "全修。",
      "name_cn": "全修。"
    },
    "17": {
      "id": 498934,
      "name": "花は咲く、修羅の如く",
      "name_cn": "群花绽放，彷如修罗"
    },
    "18": {
      "id": 518090,
      "name": "九龍ジェネリックロマンス",
      "name_cn": "九龙大众浪漫"
    },
    "19": {
      "id": 473497,
      "name": "悪役令嬢転生おじさん",
      "name_cn": "中年上班族转生恶役"
    },
    "20": {
      "id": 496617,
      "name": "SAKAMOTO DAYS",
      "name_cn": "坂本日常"
    }
  }
} as const

// 导出年份和排名范围
export const years = Array.from({ length: 30 }, (_, i) => 2025 - i)
export const ranks = Array.from({ length: 20 }, (_, i) => i + 1)
